content-org/docs.org
#+hugo_base_dir: ../
#+hugo_level_offset: 0
#+seq_todo: TODO DONE
#+startup: indent
#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: admonition
#+author:
#+hugo_custom_front_matter: :author "Matt Maguire"
#+filetags: @Docs
#+hugo_section: docs


** DONE Teaching Resources
:PROPERTIES:
:EXPORT_FILE_NAME: index
:EXPORT_HUGO_BUNDLE: teaching-resources
:EXPORT_DATE: 2024-10-10
:EXPORT_HUGO_MENU:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER:
:END:

*** Miscellanous Teaching Resources

The following websites have resources I have stumbled across that may be useful for teaching maths and science in a secondary school context:
- https://www.maths4everyone.com/ — a range of free worksheets and codebreakers.
- https://www.math-aids.com/ — auto-generated worksheets (can specify metric units)
- https://www.mathsisfun.com/ — contains puzzles and interactives
- https://www.nextlevelmaths.com/ — contains some teaching materials and interactives
- https://www.weareteachers.com/build-a-classroom-escape-room-lesson/ — how-to construct an escape room activity
- https://www.mashupmath.com/freemathpuzzles — Maths puzzles for various grades up to year 8
- https://www.mathonthefly.com/worksheets/ — More worksheets
- https://krazydad.com/ — Maths-related puzzles in printable form
- https://oersi.org/ — Open Educational Resources Search Index
- https://mathbits.com/ — MathBits resources
- https://spacemath.gsfc.nasa.gov/ — NASA Application of maths for students

*** Other Resources
- https://github.com/rossant/awesome-math — a curated list of maths learning resources
- https://www.cultofpedagogy.com/ — lots of interesting pedagogical resources

