content/posts/docs-teaching-resources/index.md
+++
title = "Teaching Resources"
date = 2024-10-10
lastmod = 2024-12-30T12:38:33+11:00
categories = ["Docs"]
draft = false
weight = 3001
author = "Matt Maguire"
hiddenFromHomePage = true
+++

## Miscellanous Teaching Resources {#miscellanous-teaching-resources}

The following websites have resources I have stumbled across that may be useful for teaching maths and science in a secondary school context:

-   <https://www.maths4everyone.com/> — a range of free worksheets and codebreakers.
-   <https://www.math-aids.com/> — auto-generated worksheets (can specify metric units)
-   <https://www.mathsisfun.com/> — contains puzzles and interactives
-   <https://www.nextlevelmaths.com/> — contains some teaching materials and interactives
-   <https://www.weareteachers.com/build-a-classroom-escape-room-lesson/> — how-to construct an escape room activity
-   <https://www.mashupmath.com/freemathpuzzles> — Maths puzzles for various grades up to year 8
-   <https://www.mathonthefly.com/worksheets/> — More worksheets
-   <https://krazydad.com/> — Maths-related puzzles in printable form
-   <https://oersi.org/> — Open Educational Resources Search Index
-   <https://mathbits.com/> — MathBits resources
-   <https://spacemath.gsfc.nasa.gov/> — NASA Application of maths for students


## Other Resources {#other-resources}

-   <https://github.com/rossant/awesome-math> — a curated list of maths learning resources
-   <https://www.cultofpedagogy.com/> — lots of interesting pedagogical resources
